{
  "_class_name": "WanTransformer3DModel",
  "_diffusers_version": "0.38.0",
  "_name_or_path": "/lustre/fsw/coreai_dlalgo_modelopt/users/jingyux/skipsoftmax/models/Wan-AI/Wan2.2-T2V-A14B-Diffusers/transformer",
  "added_kv_proj_dim": null,
  "attention_head_dim": 128,
  "cross_attn_norm": true,
  "eps": 1e-06,
  "ffn_dim": 13824,
  "freq_dim": 256,
  "image_dim": null,
  "in_channels": 16,
  "num_attention_heads": 40,
  "num_layers": 40,
  "out_channels": 16,
  "patch_size": [
    1,
    2,
    2
  ],
  "pos_embed_seq_len": null,
  "qk_norm": "rms_norm_across_heads",
  "rope_max_seq_len": 1024,
  "text_dim": 4096,
  "sparse_attention_config": {
    "config_groups": {
      "group_0": {
        "algorithm": "skip_softmax",
        "targets": [
          "WanAttention"
        ],
        "ignore": [
          "blocks.0.attn1",
          "blocks.0.attn2",
          "blocks.1.attn1",
          "blocks.1.attn2",
          "blocks.2.attn2",
          "blocks.3.attn2",
          "blocks.4.attn2",
          "blocks.5.attn2",
          "blocks.6.attn2",
          "blocks.7.attn2",
          "blocks.8.attn2",
          "blocks.9.attn2",
          "blocks.10.attn2",
          "blocks.11.attn2",
          "blocks.12.attn2",
          "blocks.13.attn2",
          "blocks.14.attn2",
          "blocks.15.attn2",
          "blocks.16.attn2",
          "blocks.17.attn2",
          "blocks.18.attn2",
          "blocks.19.attn2",
          "blocks.20.attn2",
          "blocks.21.attn2",
          "blocks.22.attn2",
          "blocks.23.attn2",
          "blocks.24.attn2",
          "blocks.25.attn2",
          "blocks.26.attn2",
          "blocks.27.attn2",
          "blocks.28.attn2",
          "blocks.29.attn2",
          "blocks.30.attn2",
          "blocks.31.attn2",
          "blocks.32.attn2",
          "blocks.33.attn2",
          "blocks.34.attn2",
          "blocks.35.attn2",
          "blocks.36.attn2",
          "blocks.37.attn2",
          "blocks.38.attn1",
          "blocks.38.attn2",
          "blocks.39.attn1",
          "blocks.39.attn2"
        ],
        "threshold_scale_factor": {
          "formula": "a * exp(b * target_sparsity)",
          "coefficients": {
            "a": 2142.7334009837796,
            "b": 4.282667871834358
          }
        },
        "target_sparsity": 0.5
      }
    },
    "producer": {
      "name": "modelopt",
      "version": "0.45.0.dev89+ge27f76fbf"
    }
  }
}